# ItemType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonItem..::..ItemType Property
RibbonItem Class See Also
---
Gets the item type.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public RibbonItemType ItemType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ItemType As RibbonItemType
	Get
```

Visual C++
---
```text
public:
property RibbonItemType ItemType {
	RibbonItemType get ();
}
```

# See Also
RibbonItem Class
Autodesk.Revit.UI Namespace